app/controllers/movies_controller.rb

  def similar
    @id = params[:movie_id]
    @movie = Movie.find(@id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]